<template>
    <div class="rule-content">
        <h3 class="tc">龙虎斗游戏说明</h3>
        <h4>规则：</h4>
        <p>1、智能合约只派两门牌：龙、虎。每门各派一只牌。</p>
        <p>2、牌面点数由A到K，A为最小，K为最大，不区分花色，点数大者获胜，牌面点数大小顺序: K、Q、J、10、9、8、7、6、5、4、3、2、A，点数相同则为和。</p>
        <p>3、玩家可投注龙、虎、和三门，如买中龙或虎，则1赔1，两门牌相同即为和，买和的赔率为1赔8。</p>
        <h4>赔率：</h4>
        <p>1、下注龙, 1赔1。</p>
        <p>2、下注虎, 1赔1。</p>
        <p>3、下注和, 1赔8。</p>
        <h4>龙虎牌面点数的产生规则：</h4>
        <p>1、由每一位玩家账户自动产生一个随机数发送到智能合约中。</p>
        <p>2、在合约里把所有玩家账户自动产生的随机数异或合并成一个最终随机数。</p>
        <p>3、再抽取最终随机数中的一部分作为龙和虎的牌面。</p>
        <p>4、合约最后把龙和虎的牌面点数返回玩家界面作为出牌结果。</p>
        <p>5、整个过程无法进行人工干预。</p>
        <h4>下注规则：</h4>
        <p>1、所有玩家的下注总额不可以大于合约总余额的八分之一（因为和的赔率为1赔8），当下注总额超过合约余额的八分之一的时候不可继续下注，提示下注失败。</p>
        <p>2、所有玩家的下注金额不能超过他账户本身的余额。</p>
        <p>3、下注成功后会直接把下注的金额转到合约内。此时如果合约的创建者进行提现，则需要满足提现后合约的余额大于所有玩家已下注金额的8倍。</p>
        <p>4、在每一局里，同一个账户可以多次进行下注，并遵循以规则。</p>
    </div>
</template>

<script>
    export default {
        name: "p11c5Rule"
    }
</script>

<style lang="scss" scoped>
    @import "../../assets/scss/gameConfig";
</style>
